[Killed] BlockStatement
js/crdt-woot/src/controller.ts:21:5
     editorDelete?: (index: number, siteId: string) => void,
     sendPayload?: (payload: Payload) => void,
     updateLocalSequence?: (s: Char[]) => void
-  ) {
-    this.site = {
-      siteId,
-      clock: 0,
-      sequence: [start, end],
-      operationPool: [],
-    };
-    this.editorInsert = editorInsert;
-    this.editorDelete = editorDelete;
-    this.sendPayload = sendPayload;
-    this.updateLocalSequence = updateLocalSequence;
-    this.pool = [];
-  }
+  ) {}
 
   main(print: boolean = false) {
killedBy: CRDT WOOT Controller Integrate local operations Should insert text in a document
statusReason: Cannot destructure property 'sequence' of 'this.site' as it is undefined.

[Killed] ArrayDeclaration
js/crdt-woot/src/controller.ts:25:17
     this.site = {
       siteId,
       clock: 0,
-      sequence: [start, end],
+      sequence: [],
       operationPool: [],
     };
killedBy: CRDT WOOT Controller Integrate local operations Should insert text in a document
statusReason: Prev char or next char out of bounds. Indexes: (0, 1)
      }. Len visible chars: 2.
      Len sequence: 0

[Killed] ArrayDeclaration
js/crdt-woot/src/controller.ts:32:17
     this.editorDelete = editorDelete;
     this.sendPayload = sendPayload;
     this.updateLocalSequence = updateLocalSequence;
-    this.pool = [];
+    this.pool = ["Stryker was here"];
   }
 
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: Unknow operation

[Survived] BooleanLiteral
js/crdt-woot/src/controller.ts:35:25
     this.pool = [];
   }
 
-  main(print: boolean = false) {
+  main(print: boolean = true) {
     let integratedIds: string[] = [];
     let sequence = this.site.sequence;

[Killed] ArrowFunction
js/crdt-woot/src/controller.ts:38:47
   main(print: boolean = false) {
     let integratedIds: string[] = [];
     let sequence = this.site.sequence;
-    let executablePayloads = this.pool.filter(({ char, operation }) =>
-      model.isExecutable(char, operation, sequence)
+    let executablePayloads = this.pool.filter(() => undefined
     );
 
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: expected '' to deeply equal 'ab'

[Killed] ConditionalExpression
js/crdt-woot/src/controller.ts:42:12
       model.isExecutable(char, operation, sequence)
     );
 
-    while (executablePayloads.length) {
+    while (false) {
       executablePayloads.map(({ char, operation, id }) => {
         if (operation === Operation.Insert) {
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: expected '' to deeply equal 'ab'

[Killed] ConditionalExpression
js/crdt-woot/src/controller.ts:44:13
 
     while (executablePayloads.length) {
       executablePayloads.map(({ char, operation, id }) => {
-        if (operation === Operation.Insert) {
+        if (false) {
           const prev = sequence.find((c) => c.id === char.prevId);
           const next = sequence.find((c) => c.id === char.nextId);
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: expected '' to deeply equal 'ab'

[Killed] BlockStatement
js/crdt-woot/src/controller.ts:44:45
 
     while (executablePayloads.length) {
       executablePayloads.map(({ char, operation, id }) => {
-        if (operation === Operation.Insert) {
-          const prev = sequence.find((c) => c.id === char.prevId);
-          const next = sequence.find((c) => c.id === char.nextId);
-          if (!prev || !next) {
-            throw Error("Can't insert operation");
-          }
-          const { sequence: newSequence } = model.integrateIns(
-            char,
-            prev,
-            next,
-            sequence
-          );
-          const index = newSequence
-            .filter((c) => c.visible)
-            .findIndex((c) => c.id === char.id);
-          if (this.editorInsert) {
-            this.editorInsert(index, char.value, char.charId.siteId);
-          }
-          sequence = newSequence;
-        } else if (operation === Operation.Delete) {
+        if (operation === Operation.Insert) {} else if (operation === Operation.Delete) {
           if (this.editorDelete) {
             const visibleCharacters = sequence.filter((c) => c.visible);
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: expected '' to deeply equal 'ab'

[Killed] EqualityOperator
js/crdt-woot/src/controller.ts:45:45
     while (executablePayloads.length) {
       executablePayloads.map(({ char, operation, id }) => {
         if (operation === Operation.Insert) {
-          const prev = sequence.find((c) => c.id === char.prevId);
+          const prev = sequence.find((c) => c.id !== char.prevId);
           const next = sequence.find((c) => c.id === char.nextId);
           if (!prev || !next) {
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document 3124 Site 2 integrates op1, op3, op4
statusReason: expected '21' to deeply equal '12'

[Killed] ConditionalExpression
js/crdt-woot/src/controller.ts:45:45
     while (executablePayloads.length) {
       executablePayloads.map(({ char, operation, id }) => {
         if (operation === Operation.Insert) {
-          const prev = sequence.find((c) => c.id === char.prevId);
+          const prev = sequence.find((c) => false);
           const next = sequence.find((c) => c.id === char.nextId);
           if (!prev || !next) {
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: Can't insert operation

[Killed] ConditionalExpression
js/crdt-woot/src/controller.ts:46:45
       executablePayloads.map(({ char, operation, id }) => {
         if (operation === Operation.Insert) {
           const prev = sequence.find((c) => c.id === char.prevId);
-          const next = sequence.find((c) => c.id === char.nextId);
+          const next = sequence.find((c) => false);
           if (!prev || !next) {
             throw Error("Can't insert operation");
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: Can't insert operation

[Killed] EqualityOperator
js/crdt-woot/src/controller.ts:46:45
       executablePayloads.map(({ char, operation, id }) => {
         if (operation === Operation.Insert) {
           const prev = sequence.find((c) => c.id === char.prevId);
-          const next = sequence.find((c) => c.id === char.nextId);
+          const next = sequence.find((c) => c.id !== char.nextId);
           if (!prev || !next) {
             throw Error("Can't insert operation");
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: expected 'ba' to deeply equal 'ab'

[Killed] BooleanLiteral
js/crdt-woot/src/controller.ts:47:15
         if (operation === Operation.Insert) {
           const prev = sequence.find((c) => c.id === char.prevId);
           const next = sequence.find((c) => c.id === char.nextId);
-          if (!prev || !next) {
+          if (prev || !next) {
             throw Error("Can't insert operation");
           }
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: Can't insert operation

[Killed] ConditionalExpression
js/crdt-woot/src/controller.ts:47:15
         if (operation === Operation.Insert) {
           const prev = sequence.find((c) => c.id === char.prevId);
           const next = sequence.find((c) => c.id === char.nextId);
-          if (!prev || !next) {
+          if (true) {
             throw Error("Can't insert operation");
           }
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: Can't insert operation

[Survived] ArrowFunction
js/crdt-woot/src/controller.ts:57:21
             sequence
           );
           const index = newSequence
-            .filter((c) => c.visible)
+            .filter(() => undefined)
             .findIndex((c) => c.id === char.id);
           if (this.editorInsert) {

[Survived] EqualityOperator
js/crdt-woot/src/controller.ts:58:31
           );
           const index = newSequence
             .filter((c) => c.visible)
-            .findIndex((c) => c.id === char.id);
+            .findIndex((c) => c.id !== char.id);
           if (this.editorInsert) {
             this.editorInsert(index, char.value, char.charId.siteId);

[Survived] ConditionalExpression
js/crdt-woot/src/controller.ts:58:31
           );
           const index = newSequence
             .filter((c) => c.visible)
-            .findIndex((c) => c.id === char.id);
+            .findIndex((c) => true);
           if (this.editorInsert) {
             this.editorInsert(index, char.value, char.charId.siteId);

[Killed] ConditionalExpression
js/crdt-woot/src/controller.ts:59:15
           const index = newSequence
             .filter((c) => c.visible)
             .findIndex((c) => c.id === char.id);
-          if (this.editorInsert) {
+          if (true) {
             this.editorInsert(index, char.value, char.charId.siteId);
           }
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: this.editorInsert is not a function

[NoCoverage] BlockStatement
js/crdt-woot/src/controller.ts:59:34
           const index = newSequence
             .filter((c) => c.visible)
             .findIndex((c) => c.id === char.id);
-          if (this.editorInsert) {
-            this.editorInsert(index, char.value, char.charId.siteId);
-          }
+          if (this.editorInsert) {}
           sequence = newSequence;
         } else if (operation === Operation.Delete) {

[Killed] BlockStatement
js/crdt-woot/src/controller.ts:63:52
             this.editorInsert(index, char.value, char.charId.siteId);
           }
           sequence = newSequence;
-        } else if (operation === Operation.Delete) {
-          if (this.editorDelete) {
-            const visibleCharacters = sequence.filter((c) => c.visible);
-            const index = visibleCharacters.findIndex((c) => c.id === char.id);
-
-            if (index !== -1) {
-              this.editorDelete(index, char.charId.siteId);
-            } else {
-              // throw Error('Could not find character to be deleted');
-            }
-          }
-          const newSequence = model.deleteChar(char, sequence);
-          sequence = newSequence;
-        }
+        } else if (operation === Operation.Delete) {}
         integratedIds.push(id);
       });
killedBy: CRDT WOOT Controller Integrate cross-site operations Commutative operations of (del, ins) and (del, del) Site 1 & 2 should end up with ab1c̶
statusReason: expected 'ab1c' to deeply equal 'ab1'

[Killed] ConditionalExpression
js/crdt-woot/src/controller.ts:63:20
             this.editorInsert(index, char.value, char.charId.siteId);
           }
           sequence = newSequence;
-        } else if (operation === Operation.Delete) {
+        } else if (false) {
           if (this.editorDelete) {
             const visibleCharacters = sequence.filter((c) => c.visible);
killedBy: CRDT WOOT Controller Integrate cross-site operations Commutative operations of (del, ins) and (del, del) Site 1 & 2 should end up with ab1c̶
statusReason: expected 'ab1c' to deeply equal 'ab1'

[Killed] ConditionalExpression
js/crdt-woot/src/controller.ts:64:15
           }
           sequence = newSequence;
         } else if (operation === Operation.Delete) {
-          if (this.editorDelete) {
+          if (true) {
             const visibleCharacters = sequence.filter((c) => c.visible);
             const index = visibleCharacters.findIndex((c) => c.id === char.id);
killedBy: CRDT WOOT Controller Integrate cross-site operations Commutative operations of (del, ins) and (del, del) Site 1 & 2 should end up with ab1c̶
statusReason: this.editorDelete is not a function

[NoCoverage] BlockStatement
js/crdt-woot/src/controller.ts:64:34
           }
           sequence = newSequence;
         } else if (operation === Operation.Delete) {
-          if (this.editorDelete) {
-            const visibleCharacters = sequence.filter((c) => c.visible);
-            const index = visibleCharacters.findIndex((c) => c.id === char.id);
-
-            if (index !== -1) {
-              this.editorDelete(index, char.charId.siteId);
-            } else {
-              // throw Error('Could not find character to be deleted');
-            }
-          }
+          if (this.editorDelete) {}
           const newSequence = model.deleteChar(char, sequence);
           sequence = newSequence;

[NoCoverage] ArrowFunction
js/crdt-woot/src/controller.ts:65:55
           sequence = newSequence;
         } else if (operation === Operation.Delete) {
           if (this.editorDelete) {
-            const visibleCharacters = sequence.filter((c) => c.visible);
+            const visibleCharacters = sequence.filter(() => undefined);
             const index = visibleCharacters.findIndex((c) => c.id === char.id);
 

[NoCoverage] ConditionalExpression
js/crdt-woot/src/controller.ts:66:62
         } else if (operation === Operation.Delete) {
           if (this.editorDelete) {
             const visibleCharacters = sequence.filter((c) => c.visible);
-            const index = visibleCharacters.findIndex((c) => c.id === char.id);
+            const index = visibleCharacters.findIndex((c) => true);
 
             if (index !== -1) {

[NoCoverage] ArrowFunction
js/crdt-woot/src/controller.ts:66:55
         } else if (operation === Operation.Delete) {
           if (this.editorDelete) {
             const visibleCharacters = sequence.filter((c) => c.visible);
-            const index = visibleCharacters.findIndex((c) => c.id === char.id);
+            const index = visibleCharacters.findIndex(() => undefined);
 
             if (index !== -1) {

[NoCoverage] EqualityOperator
js/crdt-woot/src/controller.ts:68:17
             const visibleCharacters = sequence.filter((c) => c.visible);
             const index = visibleCharacters.findIndex((c) => c.id === char.id);
 
-            if (index !== -1) {
+            if (index === -1) {
               this.editorDelete(index, char.charId.siteId);
             } else {

[NoCoverage] ConditionalExpression
js/crdt-woot/src/controller.ts:68:17
             const visibleCharacters = sequence.filter((c) => c.visible);
             const index = visibleCharacters.findIndex((c) => c.id === char.id);
 
-            if (index !== -1) {
+            if (false) {
               this.editorDelete(index, char.charId.siteId);
             } else {

[Killed] BooleanLiteral
js/crdt-woot/src/controller.ts:79:43
         }
         integratedIds.push(id);
       });
-      this.pool = this.pool.filter((p) => !integratedIds.includes(p.id));
+      this.pool = this.pool.filter((p) => integratedIds.includes(p.id));
       integratedIds = [];
       executablePayloads = this.pool.filter(({ char, operation }) =>
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: expected 'a' to deeply equal 'ab'

[Killed] ArrowFunction
js/crdt-woot/src/controller.ts:79:36
         }
         integratedIds.push(id);
       });
-      this.pool = this.pool.filter((p) => !integratedIds.includes(p.id));
+      this.pool = this.pool.filter(() => undefined);
       integratedIds = [];
       executablePayloads = this.pool.filter(({ char, operation }) =>
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: expected 'a' to deeply equal 'ab'

[Killed] ArrowFunction
js/crdt-woot/src/controller.ts:81:45
       });
       this.pool = this.pool.filter((p) => !integratedIds.includes(p.id));
       integratedIds = [];
-      executablePayloads = this.pool.filter(({ char, operation }) =>
-        model.isExecutable(char, operation, sequence)
+      executablePayloads = this.pool.filter(() => undefined
       );
     }
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: expected 'a' to deeply equal 'ab'

[Killed] LogicalOperator
js/crdt-woot/src/controller.ts:86:5
       );
     }
     this.site.sequence = sequence;
-    this.updateLocalSequence && this.updateLocalSequence(sequence);
+    this.updateLocalSequence || this.updateLocalSequence(sequence);
   }
 
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: this.updateLocalSequence is not a function

[Survived] ConditionalExpression
js/crdt-woot/src/controller.ts:86:5
       );
     }
     this.site.sequence = sequence;
-    this.updateLocalSequence && this.updateLocalSequence(sequence);
+    false;
   }
 

[Killed] BlockStatement
js/crdt-woot/src/controller.ts:89:66
     this.updateLocalSequence && this.updateLocalSequence(sequence);
   }
 
-  generateDel(position: number, print: boolean = false): Payload {
-    const adjustedPosition = position + 1; // account for first element that is invisible
-    const { prevId } = model.position(adjustedPosition, this.site.sequence);
-    const char = this.site.sequence.find((c) => c.id === prevId);
-    print && console.log(char);
-    this.deleteChar(char);
-    return {
-      operation: Operation.Delete,
-      char,
-      id: uuidv4(),
-    };
-  }
+  generateDel(position: number, print: boolean = false): Payload {}
 
   generateIns(
killedBy: CRDT WOOT Controller Integrate cross-site operations Commutative operations of (del, ins) and (del, del) Site 1 & 2 should end up with ab1c̶
statusReason: expected 'abc' to deeply equal 'ab'

[Survived] BooleanLiteral
js/crdt-woot/src/controller.ts:89:50
     this.updateLocalSequence && this.updateLocalSequence(sequence);
   }
 
-  generateDel(position: number, print: boolean = false): Payload {
+  generateDel(position: number, print: boolean = true): Payload {
     const adjustedPosition = position + 1; // account for first element that is invisible
     const { prevId } = model.position(adjustedPosition, this.site.sequence);

[Killed] ArithmeticOperator
js/crdt-woot/src/controller.ts:90:30
   }
 
   generateDel(position: number, print: boolean = false): Payload {
-    const adjustedPosition = position + 1; // account for first element that is invisible
+    const adjustedPosition = position - 1; // account for first element that is invisible
     const { prevId } = model.position(adjustedPosition, this.site.sequence);
     const char = this.site.sequence.find((c) => c.id === prevId);
killedBy: CRDT WOOT Controller Integrate cross-site operations Commutative operations of (del, ins) and (del, del) Site 1 & 2 should end up with ab1c̶
statusReason: expected 'bc' to deeply equal 'ab'

[Killed] EqualityOperator
js/crdt-woot/src/controller.ts:92:49
   generateDel(position: number, print: boolean = false): Payload {
     const adjustedPosition = position + 1; // account for first element that is invisible
     const { prevId } = model.position(adjustedPosition, this.site.sequence);
-    const char = this.site.sequence.find((c) => c.id === prevId);
+    const char = this.site.sequence.find((c) => c.id !== prevId);
     print && console.log(char);
     this.deleteChar(char);
killedBy: CRDT WOOT Controller Integrate cross-site operations Commutative operations of (del, ins) and (del, del) Site 1 & 2 should end up with ab1c̶
statusReason: expected 'abc' to deeply equal 'ab'

[Killed] ArrowFunction
js/crdt-woot/src/controller.ts:92:42
   generateDel(position: number, print: boolean = false): Payload {
     const adjustedPosition = position + 1; // account for first element that is invisible
     const { prevId } = model.position(adjustedPosition, this.site.sequence);
-    const char = this.site.sequence.find((c) => c.id === prevId);
+    const char = this.site.sequence.find(() => undefined);
     print && console.log(char);
     this.deleteChar(char);
killedBy: CRDT WOOT Controller Integrate cross-site operations Commutative operations of (del, ins) and (del, del) Site 1 & 2 should end up with ab1c̶
statusReason: Cannot read property 'id' of undefined

[Survived] ConditionalExpression
js/crdt-woot/src/controller.ts:93:5
     const adjustedPosition = position + 1; // account for first element that is invisible
     const { prevId } = model.position(adjustedPosition, this.site.sequence);
     const char = this.site.sequence.find((c) => c.id === prevId);
-    print && console.log(char);
+    false;
     this.deleteChar(char);
     return {

[Survived] LogicalOperator
js/crdt-woot/src/controller.ts:93:5
     const adjustedPosition = position + 1; // account for first element that is invisible
     const { prevId } = model.position(adjustedPosition, this.site.sequence);
     const char = this.site.sequence.find((c) => c.id === prevId);
-    print && console.log(char);
+    print || console.log(char);
     this.deleteChar(char);
     return {

[Killed] ObjectLiteral
js/crdt-woot/src/controller.ts:95:12
     const char = this.site.sequence.find((c) => c.id === prevId);
     print && console.log(char);
     this.deleteChar(char);
-    return {
-      operation: Operation.Delete,
-      char,
-      id: uuidv4(),
-    };
+    return {};
   }
 
killedBy: CRDT WOOT Controller Integrate cross-site operations Commutative operations of (del, ins) and (del, del) Site 1 & 2 should end up with ab1c̶
statusReason: Unknow operation

[Survived] BooleanLiteral
js/crdt-woot/src/controller.ts:105:22
   generateIns(
     position: number,
     alpha: string,
-    print: boolean = false
+    print: boolean = true
   ): Payload {
     const { sequence, clock, siteId } = this.site;

[Killed] BlockStatement
js/crdt-woot/src/controller.ts:106:14
     position: number,
     alpha: string,
     print: boolean = false
-  ): Payload {
-    const { sequence, clock, siteId } = this.site;
-    const newClock = clock + 1;
-
-    const newChar = model.prepareInsert(
-      position,
-      alpha,
-      siteId,
-      newClock,
-      sequence
-    );
-    const payload = {
-      char: { ...newChar },
-      operation: Operation.Insert,
-      id: uuidv4(),
-    };
-
-    const newSequence = model.insert(newChar, sequence);
-    this.site = { ...this.site, clock: newClock, sequence: newSequence };
-    this.updateLocalSequence && this.updateLocalSequence(newSequence);
-
-    return payload;
-  }
+  ): Payload {}
 
   reception(payload: Payload) {
killedBy: CRDT WOOT Controller Integrate local operations Should insert text in a document
statusReason: expected '' to deeply equal 'abc'

[Survived] ArithmeticOperator
js/crdt-woot/src/controller.ts:108:22
     print: boolean = false
   ): Payload {
     const { sequence, clock, siteId } = this.site;
-    const newClock = clock + 1;
+    const newClock = clock - 1;
 
     const newChar = model.prepareInsert(

[Killed] ObjectLiteral
js/crdt-woot/src/controller.ts:117:21
       newClock,
       sequence
     );
-    const payload = {
-      char: { ...newChar },
-      operation: Operation.Insert,
-      id: uuidv4(),
-    };
+    const payload = {};
 
     const newSequence = model.insert(newChar, sequence);
killedBy: CRDT WOOT Controller Integrate local operations Should delete a character in a document
statusReason: Cannot read property 'id' of undefined

[Killed] LogicalOperator
js/crdt-woot/src/controller.ts:125:5
 
     const newSequence = model.insert(newChar, sequence);
     this.site = { ...this.site, clock: newClock, sequence: newSequence };
-    this.updateLocalSequence && this.updateLocalSequence(newSequence);
+    this.updateLocalSequence || this.updateLocalSequence(newSequence);
 
     return payload;
killedBy: CRDT WOOT Controller Integrate local operations Should insert text in a document
statusReason: this.updateLocalSequence is not a function

[Survived] ConditionalExpression
js/crdt-woot/src/controller.ts:125:5
 
     const newSequence = model.insert(newChar, sequence);
     this.site = { ...this.site, clock: newClock, sequence: newSequence };
-    this.updateLocalSequence && this.updateLocalSequence(newSequence);
+    false;
 
     return payload;

[Killed] BlockStatement
js/crdt-woot/src/controller.ts:130:31
     return payload;
   }
 
-  reception(payload: Payload) {
-    this.pool.push(payload);
-  }
+  reception(payload: Payload) {}
 
   deleteChar(char: Char) {
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: expected '' to deeply equal 'ab'

[Killed] BlockStatement
js/crdt-woot/src/controller.ts:134:26
     this.pool.push(payload);
   }
 
-  deleteChar(char: Char) {
-    const newSequence = model.deleteChar(char, this.site.sequence);
-    this.site = { ...this.site, sequence: newSequence };
-    this.updateLocalSequence && this.updateLocalSequence(newSequence);
-  }
+  deleteChar(char: Char) {}
 
   getState() {
killedBy: CRDT WOOT Controller Integrate local operations Should delete a character in a document
statusReason: expected 'abc' to deeply equal 'ac'

[Killed] LogicalOperator
js/crdt-woot/src/controller.ts:137:5
   deleteChar(char: Char) {
     const newSequence = model.deleteChar(char, this.site.sequence);
     this.site = { ...this.site, sequence: newSequence };
-    this.updateLocalSequence && this.updateLocalSequence(newSequence);
+    this.updateLocalSequence || this.updateLocalSequence(newSequence);
   }
 
killedBy: CRDT WOOT Controller Integrate local operations Should delete a character in a document
statusReason: this.updateLocalSequence is not a function

[Survived] ConditionalExpression
js/crdt-woot/src/controller.ts:137:5
   deleteChar(char: Char) {
     const newSequence = model.deleteChar(char, this.site.sequence);
     this.site = { ...this.site, sequence: newSequence };
-    this.updateLocalSequence && this.updateLocalSequence(newSequence);
+    false;
   }
 

[Killed] BlockStatement
js/crdt-woot/src/controller.ts:140:14
     this.updateLocalSequence && this.updateLocalSequence(newSequence);
   }
 
-  getState() {
-    return model.getState(this.site.sequence);
-  }
+  getState() {}
 }
 
killedBy: CRDT WOOT Controller Integrate local operations Should insert text in a document
statusReason: expected undefined to deeply equal 'abc'
