[Killed] BlockStatement
js/crdt-woot/src/model.ts:5:68
 import { v4 as uuidv4 } from 'uuid';
 import _ from 'lodash';
 
-export function comesBefore(char1: CharId, char2: CharId): boolean {
-  return (
-    char1.siteId < char2.siteId ||
-    (char1.siteId === char2.siteId && char1.clock < char2.clock)
-  );
-}
+export function comesBefore(char1: CharId, char2: CharId): boolean {}
 
 export function prepareInsert(
killedBy: CRDT WOOT Model determine precedence between two characters from different sites
statusReason: expected undefined to deeply equal true

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:7:5
 
 export function comesBefore(char1: CharId, char2: CharId): boolean {
   return (
-    char1.siteId < char2.siteId ||
+    char1.siteId <= char2.siteId ||
     (char1.siteId === char2.siteId && char1.clock < char2.clock)
   );
killedBy: CRDT WOOT Model determines precedence between the same characters
statusReason: expected true to deeply equal false

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:7:5
 
 export function comesBefore(char1: CharId, char2: CharId): boolean {
   return (
-    char1.siteId < char2.siteId ||
-    (char1.siteId === char2.siteId && char1.clock < char2.clock)
+    true
   );
 }
killedBy: CRDT WOOT Model determines precedence between the same characters
statusReason: expected true to deeply equal false

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:8:6
 export function comesBefore(char1: CharId, char2: CharId): boolean {
   return (
     char1.siteId < char2.siteId ||
-    (char1.siteId === char2.siteId && char1.clock < char2.clock)
+    (char1.siteId !== char2.siteId && char1.clock < char2.clock)
   );
 }
killedBy: CRDT WOOT Model determine precedence between two characters from same sites
statusReason: expected false to deeply equal true

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:8:6
 export function comesBefore(char1: CharId, char2: CharId): boolean {
   return (
     char1.siteId < char2.siteId ||
-    (char1.siteId === char2.siteId && char1.clock < char2.clock)
+    (true && char1.clock < char2.clock)
   );
 }
killedBy: CRDT WOOT Model integrate insert operations such that site ends ups with a312b
statusReason: expected true to deeply equal false

[Killed] BlockStatement
js/crdt-woot/src/model.ts:18:9
   siteId: string,
   clock: number,
   sequence: Char[]
-): Char {
-  const { nextId, prevId } = position(index, sequence);
-  return {
-    id: uuidv4(),
-    charId: {
-      siteId,
-      clock,
-    },
-    value: alpha,
-    visible: true,
-    prevId,
-    nextId,
-  };
-}
+): Char {}
 
 export function insert(char: Char, sequence: Char[]) {
killedBy: CRDT WOOT Controller Integrate local operations Should insert text in a document
statusReason: Cannot read property 'prevId' of undefined

[Killed] ObjectLiteral
js/crdt-woot/src/model.ts:20:10
   sequence: Char[]
 ): Char {
   const { nextId, prevId } = position(index, sequence);
-  return {
-    id: uuidv4(),
-    charId: {
-      siteId,
-      clock,
-    },
-    value: alpha,
-    visible: true,
-    prevId,
-    nextId,
-  };
+  return {};
 }
 
killedBy: CRDT WOOT Controller Integrate local operations Should insert text in a document
statusReason: Can't find the prevChar.id or nextChar.id

[Killed] ObjectLiteral
js/crdt-woot/src/model.ts:22:13
   const { nextId, prevId } = position(index, sequence);
   return {
     id: uuidv4(),
-    charId: {
-      siteId,
-      clock,
-    },
+    charId: {},
     value: alpha,
     visible: true,
killedBy: CRDT WOOT Controller Integrate cross-site operations Each site should result in document a312b Site 3 integrate op1, op2, op3
statusReason: expected 'a21b' to deeply equal 'a12b'

[Killed] BooleanLiteral
js/crdt-woot/src/model.ts:27:14
       clock,
     },
     value: alpha,
-    visible: true,
+    visible: false,
     prevId,
     nextId,
killedBy: CRDT WOOT Controller Integrate local operations Should insert text in a document
statusReason: Prev char or next char out of bounds. Indexes: (1, 2)
      }. Len visible chars: 2.
      Len sequence: 3

[Killed] BlockStatement
js/crdt-woot/src/model.ts:33:54
   };
 }
 
-export function insert(char: Char, sequence: Char[]) {
-  const prev = sequence.find((c) => c.id === char.prevId);
-  const next = sequence.find((c) => c.id === char.nextId);
-
-  if (!next || !prev) {
-    throw Error("Can't find the prevChar.id or nextChar.id");
-  }
-
-  const insertIndex = 1 + sequence.findIndex((c) => c.id === char.prevId);
-
-  const tmpSequence = _.cloneDeep(sequence);
-  tmpSequence.splice(insertIndex, 0, char);
-  return tmpSequence;
-}
+export function insert(char: Char, sequence: Char[]) {}
 
 export function integrateIns(
killedBy: CRDT WOOT Model local insert operation should insert
statusReason: Cannot read property '1' of undefined

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:34:37
 }
 
 export function insert(char: Char, sequence: Char[]) {
-  const prev = sequence.find((c) => c.id === char.prevId);
+  const prev = sequence.find((c) => false);
   const next = sequence.find((c) => c.id === char.nextId);
 
killedBy: CRDT WOOT Model local insert operation should insert
statusReason: Can't find the prevChar.id or nextChar.id

[Killed] ArrowFunction
js/crdt-woot/src/model.ts:34:30
 }
 
 export function insert(char: Char, sequence: Char[]) {
-  const prev = sequence.find((c) => c.id === char.prevId);
+  const prev = sequence.find(() => undefined);
   const next = sequence.find((c) => c.id === char.nextId);
 
killedBy: CRDT WOOT Model local insert operation should insert
statusReason: Can't find the prevChar.id or nextChar.id

[Killed] ArrowFunction
js/crdt-woot/src/model.ts:35:30
 
 export function insert(char: Char, sequence: Char[]) {
   const prev = sequence.find((c) => c.id === char.prevId);
-  const next = sequence.find((c) => c.id === char.nextId);
+  const next = sequence.find(() => undefined);
 
   if (!next || !prev) {
killedBy: CRDT WOOT Model local insert operation should insert
statusReason: Can't find the prevChar.id or nextChar.id

[Killed] BooleanLiteral
js/crdt-woot/src/model.ts:37:7
   const prev = sequence.find((c) => c.id === char.prevId);
   const next = sequence.find((c) => c.id === char.nextId);
 
-  if (!next || !prev) {
+  if (next || !prev) {
     throw Error("Can't find the prevChar.id or nextChar.id");
   }
killedBy: CRDT WOOT Model local insert operation should insert
statusReason: Can't find the prevChar.id or nextChar.id

[Killed] BooleanLiteral
js/crdt-woot/src/model.ts:37:16
   const prev = sequence.find((c) => c.id === char.prevId);
   const next = sequence.find((c) => c.id === char.nextId);
 
-  if (!next || !prev) {
+  if (!next || prev) {
     throw Error("Can't find the prevChar.id or nextChar.id");
   }
killedBy: CRDT WOOT Model local insert operation should insert
statusReason: Can't find the prevChar.id or nextChar.id

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:41:53
     throw Error("Can't find the prevChar.id or nextChar.id");
   }
 
-  const insertIndex = 1 + sequence.findIndex((c) => c.id === char.prevId);
+  const insertIndex = 1 + sequence.findIndex((c) => c.id !== char.prevId);
 
   const tmpSequence = _.cloneDeep(sequence);
killedBy: CRDT WOOT Model local insert operation should insert
statusReason: expected { Object (id, charId, ...) } to deeply equal { Object (id, charId, ...) }

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:41:53
     throw Error("Can't find the prevChar.id or nextChar.id");
   }
 
-  const insertIndex = 1 + sequence.findIndex((c) => c.id === char.prevId);
+  const insertIndex = 1 + sequence.findIndex((c) => true);
 
   const tmpSequence = _.cloneDeep(sequence);
killedBy: CRDT WOOT Model integrate insert operations such that site ends ups with a312b
statusReason: expected '31ba' to deeply equal 'a31b'

[Survived] BooleanLiteral
js/crdt-woot/src/model.ts:53:20
   prev: Char,
   next: Char,
   sequence: Char[],
-  print: boolean = false
+  print: boolean = true
 ): { sequence: Char[]; index: number } {
   const lowerbound = sequence.findIndex((c) => c.id === prev.id);

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:55:48
   sequence: Char[],
   print: boolean = false
 ): { sequence: Char[]; index: number } {
-  const lowerbound = sequence.findIndex((c) => c.id === prev.id);
+  const lowerbound = sequence.findIndex((c) => c.id !== prev.id);
   const upperbound = sequence.findIndex((c) => c.id === next.id);
 
killedBy: CRDT WOOT Model integrate insert operation from other site that is inserted at the same position
statusReason: Maximum call stack size exceeded

[Killed] ArrowFunction
js/crdt-woot/src/model.ts:55:41
   sequence: Char[],
   print: boolean = false
 ): { sequence: Char[]; index: number } {
-  const lowerbound = sequence.findIndex((c) => c.id === prev.id);
+  const lowerbound = sequence.findIndex(() => undefined);
   const upperbound = sequence.findIndex((c) => c.id === next.id);
 
killedBy: CRDT WOOT Model integrate insert operation
statusReason: expected { Object (id, charId, ...) } to deeply equal { Object (id, charId, ...) }

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:56:48
   print: boolean = false
 ): { sequence: Char[]; index: number } {
   const lowerbound = sequence.findIndex((c) => c.id === prev.id);
-  const upperbound = sequence.findIndex((c) => c.id === next.id);
+  const upperbound = sequence.findIndex((c) => c.id !== next.id);
 
   const subsequence = sequence.filter(
killedBy: CRDT WOOT Model integrate insert operation
statusReason: expected { Object (id, charId, ...) } to deeply equal { Object (id, charId, ...) }

[Killed] ArrowFunction
js/crdt-woot/src/model.ts:56:41
   print: boolean = false
 ): { sequence: Char[]; index: number } {
   const lowerbound = sequence.findIndex((c) => c.id === prev.id);
-  const upperbound = sequence.findIndex((c) => c.id === next.id);
+  const upperbound = sequence.findIndex(() => undefined);
 
   const subsequence = sequence.filter(
killedBy: CRDT WOOT Model integrate insert operations such that site ends ups with a312b
statusReason: expected 'a31b2' to deeply equal 'a312b'

[Killed] LogicalOperator
js/crdt-woot/src/model.ts:59:15
   const upperbound = sequence.findIndex((c) => c.id === next.id);
 
   const subsequence = sequence.filter(
-    (c, i) => i > lowerbound && i < upperbound
+    (c, i) => i > lowerbound || i < upperbound
   );
 
killedBy: CRDT WOOT Model integrate insert operation
statusReason: Maximum call stack size exceeded

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:59:15
   const upperbound = sequence.findIndex((c) => c.id === next.id);
 
   const subsequence = sequence.filter(
-    (c, i) => i > lowerbound && i < upperbound
+    (c, i) => i >= lowerbound && i < upperbound
   );
 
killedBy: CRDT WOOT Model integrate insert operation
statusReason: expected { Object (id, charId, ...) } to deeply equal { Object (id, charId, ...) }

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:62:7
     (c, i) => i > lowerbound && i < upperbound
   );
 
-  if (subsequence.length === 0) {
+  if (subsequence.length !== 0) {
     const tmpSequence = _.cloneDeep(sequence);
     tmpSequence.splice(upperbound, 0, incomingChar);
killedBy: CRDT WOOT Model integrate insert operation
statusReason: Maximum call stack size exceeded

[Killed] BlockStatement
js/crdt-woot/src/model.ts:62:33
     (c, i) => i > lowerbound && i < upperbound
   );
 
-  if (subsequence.length === 0) {
-    const tmpSequence = _.cloneDeep(sequence);
-    tmpSequence.splice(upperbound, 0, incomingChar);
-    return { sequence: tmpSequence, index: upperbound };
-  } else {
+  if (subsequence.length === 0) {} else {
     const L = [prev];
 
killedBy: CRDT WOOT Model integrate insert operation
statusReason: Cannot destructure property 'sequence' of 'model.integrateIns(...)' as it is undefined.

[Killed] BlockStatement
js/crdt-woot/src/model.ts:66:10
     const tmpSequence = _.cloneDeep(sequence);
     tmpSequence.splice(upperbound, 0, incomingChar);
     return { sequence: tmpSequence, index: upperbound };
-  } else {
-    const L = [prev];
-
-    subsequence.forEach((char) => {
-      const cPrevIndex = sequence.findIndex((c) => c.id === char.prevId);
-      const cNextIndex = sequence.findIndex((c) => c.id === char.nextId);
-      if (cPrevIndex <= lowerbound && upperbound <= cNextIndex) {
-        L.push(char);
-      }
-    });
-    L.push(next);
-
-    let i = 1;
-    while (i < L.length - 1 && comesBefore(L[i].charId, incomingChar.charId)) {
-      i = i + 1;
-    }
-    return integrateIns(incomingChar, L[i - 1], L[i], sequence, print);
-  }
+  } else {}
 }
 
killedBy: CRDT WOOT Model integrate insert operation from other site that is inserted at the same position
statusReason: Cannot destructure property 'sequence' of 'model.integrateIns(...)' as it is undefined.

[Killed] ArrayDeclaration
js/crdt-woot/src/model.ts:67:15
     tmpSequence.splice(upperbound, 0, incomingChar);
     return { sequence: tmpSequence, index: upperbound };
   } else {
-    const L = [prev];
+    const L = [];
 
     subsequence.forEach((char) => {
killedBy: CRDT WOOT Model integrate insert operations such that site 3 end up with 3124
statusReason: expected '3142' to deeply equal '3124'

[Timeout] BlockStatement
js/crdt-woot/src/model.ts:69:35
   } else {
     const L = [prev];
 
-    subsequence.forEach((char) => {
-      const cPrevIndex = sequence.findIndex((c) => c.id === char.prevId);
-      const cNextIndex = sequence.findIndex((c) => c.id === char.nextId);
-      if (cPrevIndex <= lowerbound && upperbound <= cNextIndex) {
-        L.push(char);
-      }
-    });
+    subsequence.forEach((char) => {});
     L.push(next);
 

[Survived] ArrowFunction
js/crdt-woot/src/model.ts:70:45
     const L = [prev];
 
     subsequence.forEach((char) => {
-      const cPrevIndex = sequence.findIndex((c) => c.id === char.prevId);
+      const cPrevIndex = sequence.findIndex(() => undefined);
       const cNextIndex = sequence.findIndex((c) => c.id === char.nextId);
       if (cPrevIndex <= lowerbound && upperbound <= cNextIndex) {

[Survived] ConditionalExpression
js/crdt-woot/src/model.ts:70:52
     const L = [prev];
 
     subsequence.forEach((char) => {
-      const cPrevIndex = sequence.findIndex((c) => c.id === char.prevId);
+      const cPrevIndex = sequence.findIndex((c) => true);
       const cNextIndex = sequence.findIndex((c) => c.id === char.nextId);
       if (cPrevIndex <= lowerbound && upperbound <= cNextIndex) {

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:71:52
 
     subsequence.forEach((char) => {
       const cPrevIndex = sequence.findIndex((c) => c.id === char.prevId);
-      const cNextIndex = sequence.findIndex((c) => c.id === char.nextId);
+      const cNextIndex = sequence.findIndex((c) => c.id !== char.nextId);
       if (cPrevIndex <= lowerbound && upperbound <= cNextIndex) {
         L.push(char);
killedBy: CRDT WOOT Model integrate insert operation from other site that is inserted at the same position
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:71:52
 
     subsequence.forEach((char) => {
       const cPrevIndex = sequence.findIndex((c) => c.id === char.prevId);
-      const cNextIndex = sequence.findIndex((c) => c.id === char.nextId);
+      const cNextIndex = sequence.findIndex((c) => true);
       if (cPrevIndex <= lowerbound && upperbound <= cNextIndex) {
         L.push(char);
killedBy: CRDT WOOT Model integrate insert operation from other site that is inserted at the same position
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:72:39
     subsequence.forEach((char) => {
       const cPrevIndex = sequence.findIndex((c) => c.id === char.prevId);
       const cNextIndex = sequence.findIndex((c) => c.id === char.nextId);
-      if (cPrevIndex <= lowerbound && upperbound <= cNextIndex) {
+      if (cPrevIndex <= lowerbound && true) {
         L.push(char);
       }
killedBy: CRDT WOOT Model integrate insert operations such that site 3 end up with 3124
statusReason: expected '2314' to deeply equal '3124'

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:72:11
     subsequence.forEach((char) => {
       const cPrevIndex = sequence.findIndex((c) => c.id === char.prevId);
       const cNextIndex = sequence.findIndex((c) => c.id === char.nextId);
-      if (cPrevIndex <= lowerbound && upperbound <= cNextIndex) {
+      if (true) {
         L.push(char);
       }
killedBy: CRDT WOOT Model integrate insert operations such that site 3 end up with 3124
statusReason: expected '2314' to deeply equal '3124'

[Killed] ArithmeticOperator
js/crdt-woot/src/model.ts:79:16
     L.push(next);
 
     let i = 1;
-    while (i < L.length - 1 && comesBefore(L[i].charId, incomingChar.charId)) {
+    while (i < L.length + 1 && comesBefore(L[i].charId, incomingChar.charId)) {
       i = i + 1;
     }
killedBy: CRDT WOOT Model integrate insert operation from other site that is inserted at the same position
statusReason: Cannot read property 'charId' of undefined

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:79:12
     L.push(next);
 
     let i = 1;
-    while (i < L.length - 1 && comesBefore(L[i].charId, incomingChar.charId)) {
+    while (false) {
       i = i + 1;
     }
killedBy: CRDT WOOT Model integrate insert operation from other site that is inserted at the same position
statusReason: expected { Object (id, charId, ...) } to deeply equal { Object (id, charId, ...) }

[Killed] ArithmeticOperator
js/crdt-woot/src/model.ts:80:11
 
     let i = 1;
     while (i < L.length - 1 && comesBefore(L[i].charId, incomingChar.charId)) {
-      i = i + 1;
+      i = i - 1;
     }
     return integrateIns(incomingChar, L[i - 1], L[i], sequence, print);
killedBy: CRDT WOOT Model integrate insert operation from other site that is inserted at the same position
statusReason: Cannot read property 'charId' of undefined

[Killed] ArithmeticOperator
js/crdt-woot/src/model.ts:82:41
     while (i < L.length - 1 && comesBefore(L[i].charId, incomingChar.charId)) {
       i = i + 1;
     }
-    return integrateIns(incomingChar, L[i - 1], L[i], sequence, print);
+    return integrateIns(incomingChar, L[i + 1], L[i], sequence, print);
   }
 }
killedBy: CRDT WOOT Model integrate insert operation from other site that is inserted at the same position
statusReason: Cannot read property 'id' of undefined

[Killed] BlockStatement
js/crdt-woot/src/model.ts:86:58
   }
 }
 
-export function deleteChar(char: Char, sequence: Char[]) {
-  return _.cloneDeep(sequence).map((c) => {
-    if (c.id === char.id) {
-      return { ...c, visible: false };
-    }
-    return c;
-  });
-}
+export function deleteChar(char: Char, sequence: Char[]) {}
 
 export function subseq(
killedBy: CRDT WOOT Model mark a deleted char as not visible
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BlockStatement
js/crdt-woot/src/model.ts:87:43
 }
 
 export function deleteChar(char: Char, sequence: Char[]) {
-  return _.cloneDeep(sequence).map((c) => {
-    if (c.id === char.id) {
-      return { ...c, visible: false };
-    }
-    return c;
-  });
+  return _.cloneDeep(sequence).map((c) => {});
 }
 
killedBy: CRDT WOOT Model mark a deleted char as not visible
statusReason: expected [ undefined ] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:88:9
 
 export function deleteChar(char: Char, sequence: Char[]) {
   return _.cloneDeep(sequence).map((c) => {
-    if (c.id === char.id) {
+    if (false) {
       return { ...c, visible: false };
     }
killedBy: CRDT WOOT Model mark a deleted char as not visible
statusReason: expected [ Array(1) ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
js/crdt-woot/src/model.ts:88:27
 
 export function deleteChar(char: Char, sequence: Char[]) {
   return _.cloneDeep(sequence).map((c) => {
-    if (c.id === char.id) {
-      return { ...c, visible: false };
-    }
+    if (c.id === char.id) {}
     return c;
   });
killedBy: CRDT WOOT Model mark a deleted char as not visible
statusReason: expected [ Array(1) ] to deeply equal [ Array(1) ]

[Killed] BooleanLiteral
js/crdt-woot/src/model.ts:89:31
 export function deleteChar(char: Char, sequence: Char[]) {
   return _.cloneDeep(sequence).map((c) => {
     if (c.id === char.id) {
-      return { ...c, visible: false };
+      return { ...c, visible: true };
     }
     return c;
killedBy: CRDT WOOT Model mark a deleted char as not visible
statusReason: expected [ Array(1) ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
js/crdt-woot/src/model.ts:99:11
   startId: string,
   endId: string,
   sequence: Char[]
-): Char[] {
-  const startIndex = sequence.findIndex((c) => c.id === startId);
-  if (startIndex === -1) {
-    throw Error('Cant find start char at site ');
-  }
-
-  let subseq = [];
-  let index = startIndex + 1;
-  while (index <= sequence.length) {
-    const nextChar = _.cloneDeep(sequence[index]);
-    if (nextChar.id === endId) {
-      break;
-    }
-    subseq.push(nextChar);
-    index = index + 1;
-  }
-  return subseq;
-}
+): Char[] {}
 
 export function position(index: number, sequence: Char[]) {
killedBy: CRDT WOOT Model get items in subsequence
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] ArrowFunction
js/crdt-woot/src/model.ts:100:41
   endId: string,
   sequence: Char[]
 ): Char[] {
-  const startIndex = sequence.findIndex((c) => c.id === startId);
+  const startIndex = sequence.findIndex(() => undefined);
   if (startIndex === -1) {
     throw Error('Cant find start char at site ');
killedBy: CRDT WOOT Model get items in subsequence
statusReason: Cant find start char at site

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:100:48
   endId: string,
   sequence: Char[]
 ): Char[] {
-  const startIndex = sequence.findIndex((c) => c.id === startId);
+  const startIndex = sequence.findIndex((c) => false);
   if (startIndex === -1) {
     throw Error('Cant find start char at site ');
killedBy: CRDT WOOT Model get items in subsequence
statusReason: Cant find start char at site

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:101:7
   sequence: Char[]
 ): Char[] {
   const startIndex = sequence.findIndex((c) => c.id === startId);
-  if (startIndex === -1) {
+  if (startIndex !== -1) {
     throw Error('Cant find start char at site ');
   }
killedBy: CRDT WOOT Model get items in subsequence
statusReason: Cant find start char at site

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:101:7
   sequence: Char[]
 ): Char[] {
   const startIndex = sequence.findIndex((c) => c.id === startId);
-  if (startIndex === -1) {
+  if (true) {
     throw Error('Cant find start char at site ');
   }
killedBy: CRDT WOOT Model get items in subsequence
statusReason: Cant find start char at site

[Killed] ArithmeticOperator
js/crdt-woot/src/model.ts:106:15
   }
 
   let subseq = [];
-  let index = startIndex + 1;
+  let index = startIndex - 1;
   while (index <= sequence.length) {
     const nextChar = _.cloneDeep(sequence[index]);
killedBy: CRDT WOOT Model get items in subsequence
statusReason: Cannot read property 'id' of undefined

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:107:10
 
   let subseq = [];
   let index = startIndex + 1;
-  while (index <= sequence.length) {
+  while (false) {
     const nextChar = _.cloneDeep(sequence[index]);
     if (nextChar.id === endId) {
killedBy: CRDT WOOT Model get items in subsequence
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:107:10
 
   let subseq = [];
   let index = startIndex + 1;
-  while (index <= sequence.length) {
+  while (index > sequence.length) {
     const nextChar = _.cloneDeep(sequence[index]);
     if (nextChar.id === endId) {
killedBy: CRDT WOOT Model get items in subsequence
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] BlockStatement
js/crdt-woot/src/model.ts:109:32
   let index = startIndex + 1;
   while (index <= sequence.length) {
     const nextChar = _.cloneDeep(sequence[index]);
-    if (nextChar.id === endId) {
-      break;
-    }
+    if (nextChar.id === endId) {}
     subseq.push(nextChar);
     index = index + 1;
killedBy: CRDT WOOT Model get items in subsequence
statusReason: Cannot read property 'id' of undefined

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:109:9
   let index = startIndex + 1;
   while (index <= sequence.length) {
     const nextChar = _.cloneDeep(sequence[index]);
-    if (nextChar.id === endId) {
+    if (true) {
       break;
     }
killedBy: CRDT WOOT Model get items in subsequence
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] ArithmeticOperator
js/crdt-woot/src/model.ts:113:13
       break;
     }
     subseq.push(nextChar);
-    index = index + 1;
+    index = index - 1;
   }
   return subseq;
killedBy: CRDT WOOT Model get items in subsequence
statusReason: Cannot read property 'id' of undefined

[Killed] BlockStatement
js/crdt-woot/src/model.ts:118:59
   return subseq;
 }
 
-export function position(index: number, sequence: Char[]) {
-  const visibleCharacters = sequence.filter((c) => c.visible);
-  visibleCharacters.unshift(sequence[0]);
-  visibleCharacters.push(sequence[sequence.length - 1]);
-
-  const prevChar = visibleCharacters[index];
-  const nextChar = visibleCharacters[index + 1];
-  if (!prevChar || !nextChar) {
-    throw Error(
-      `Prev char or next char out of bounds. Indexes: (${index}, ${index + 1})
-      }. Len visible chars: ${visibleCharacters.length}.
-      Len sequence: ${sequence.length}`
-    );
-  }
-  const prevId = prevChar.id;
-  const nextId = nextChar.id;
-  return {
-    prevId,
-    nextId,
-  };
-}
+export function position(index: number, sequence: Char[]) {}
 
 export function contains(id: string, sequence: Char[]): boolean {
killedBy: CRDT WOOT Model get the position of neighbouring characters
statusReason: expected undefined to deeply equal { Object (prevId, nextId) }

[Killed] ArrowFunction
js/crdt-woot/src/model.ts:119:45
 }
 
 export function position(index: number, sequence: Char[]) {
-  const visibleCharacters = sequence.filter((c) => c.visible);
+  const visibleCharacters = sequence.filter(() => undefined);
   visibleCharacters.unshift(sequence[0]);
   visibleCharacters.push(sequence[sequence.length - 1]);
killedBy: CRDT WOOT Model get the position of neighbouring characters
statusReason: expected { Object (prevId, nextId) } to deeply equal { Object (prevId, nextId) }

[Killed] ArithmeticOperator
js/crdt-woot/src/model.ts:121:35
 export function position(index: number, sequence: Char[]) {
   const visibleCharacters = sequence.filter((c) => c.visible);
   visibleCharacters.unshift(sequence[0]);
-  visibleCharacters.push(sequence[sequence.length - 1]);
+  visibleCharacters.push(sequence[sequence.length + 1]);
 
   const prevChar = visibleCharacters[index];
killedBy: CRDT WOOT Model get the position of neighbouring characters
statusReason: Prev char or next char out of bounds. Indexes: (3, 4)
      }. Len visible chars: 5.
      Len sequence: 5

[Killed] ArithmeticOperator
js/crdt-woot/src/model.ts:124:38
   visibleCharacters.push(sequence[sequence.length - 1]);
 
   const prevChar = visibleCharacters[index];
-  const nextChar = visibleCharacters[index + 1];
+  const nextChar = visibleCharacters[index - 1];
   if (!prevChar || !nextChar) {
     throw Error(
killedBy: CRDT WOOT Model get the position of neighbouring characters
statusReason: Prev char or next char out of bounds. Indexes: (0, 1)
      }. Len visible chars: 5.
      Len sequence: 5

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:125:7
 
   const prevChar = visibleCharacters[index];
   const nextChar = visibleCharacters[index + 1];
-  if (!prevChar || !nextChar) {
+  if (true) {
     throw Error(
       `Prev char or next char out of bounds. Indexes: (${index}, ${index + 1})
killedBy: CRDT WOOT Model get the position of neighbouring characters
statusReason: Prev char or next char out of bounds. Indexes: (0, 1)
      }. Len visible chars: 5.
      Len sequence: 5

[Killed] BooleanLiteral
js/crdt-woot/src/model.ts:125:7
 
   const prevChar = visibleCharacters[index];
   const nextChar = visibleCharacters[index + 1];
-  if (!prevChar || !nextChar) {
+  if (prevChar || !nextChar) {
     throw Error(
       `Prev char or next char out of bounds. Indexes: (${index}, ${index + 1})
killedBy: CRDT WOOT Model get the position of neighbouring characters
statusReason: Prev char or next char out of bounds. Indexes: (0, 1)
      }. Len visible chars: 5.
      Len sequence: 5

[NoCoverage] ArithmeticOperator
js/crdt-woot/src/model.ts:127:68
   const nextChar = visibleCharacters[index + 1];
   if (!prevChar || !nextChar) {
     throw Error(
-      `Prev char or next char out of bounds. Indexes: (${index}, ${index + 1})
+      `Prev char or next char out of bounds. Indexes: (${index}, ${index - 1})
       }. Len visible chars: ${visibleCharacters.length}.
       Len sequence: ${sequence.length}`

[Killed] BlockStatement
js/crdt-woot/src/model.ts:140:65
   };
 }
 
-export function contains(id: string, sequence: Char[]): boolean {
-  return sequence.find((c) => c.id === id) !== undefined;
-}
+export function contains(id: string, sequence: Char[]): boolean {}
 
 export function isExecutable(
killedBy: CRDT WOOT Model check if the characters exists in sequence
statusReason: expected undefined to deeply equal false

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:141:31
 }
 
 export function contains(id: string, sequence: Char[]): boolean {
-  return sequence.find((c) => c.id === id) !== undefined;
+  return sequence.find((c) => false) !== undefined;
 }
 
killedBy: CRDT WOOT Model check if the characters exists in sequence
statusReason: expected false to deeply equal true
