[Killed] ArrowFunction
js/crdt-woot/src/model.ts:141:24
 }
 
 export function contains(id: string, sequence: Char[]): boolean {
-  return sequence.find((c) => c.id === id) !== undefined;
+  return sequence.find(() => undefined) !== undefined;
 }
 
killedBy: CRDT WOOT Model check if the characters exists in sequence
statusReason: expected false to deeply equal true

[Killed] BlockStatement
js/crdt-woot/src/model.ts:148:3
   char: Char,
   operation: Operation,
   sequence: Char[]
-) {
-  if (operation === Operation.Delete) {
-    return contains(char.id, sequence);
-  } else if (operation === Operation.Insert) {
-    return (
-      contains(char.nextId, sequence) &&
-      contains(char.prevId, sequence) &&
-      !contains(char.id, sequence)
-    );
-  } else {
-    throw Error('Unknow operation');
-  }
-}
+) {}
 
 export function getState(sequence: Char[]) {
killedBy: CRDT WOOT Model check if insert operation is executable
statusReason: expected undefined to deeply equal true

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:149:7
   operation: Operation,
   sequence: Char[]
 ) {
-  if (operation === Operation.Delete) {
+  if (true) {
     return contains(char.id, sequence);
   } else if (operation === Operation.Insert) {
killedBy: CRDT WOOT Model check if insert operation is executable
statusReason: expected false to deeply equal true

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:149:7
   operation: Operation,
   sequence: Char[]
 ) {
-  if (operation === Operation.Delete) {
+  if (operation !== Operation.Delete) {
     return contains(char.id, sequence);
   } else if (operation === Operation.Insert) {
killedBy: CRDT WOOT Model check if insert operation is executable
statusReason: expected false to deeply equal true

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:151:14
 ) {
   if (operation === Operation.Delete) {
     return contains(char.id, sequence);
-  } else if (operation === Operation.Insert) {
+  } else if (operation !== Operation.Insert) {
     return (
       contains(char.nextId, sequence) &&
killedBy: CRDT WOOT Model check if insert operation is executable
statusReason: Unknow operation

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:151:14
 ) {
   if (operation === Operation.Delete) {
     return contains(char.id, sequence);
-  } else if (operation === Operation.Insert) {
+  } else if (false) {
     return (
       contains(char.nextId, sequence) &&
killedBy: CRDT WOOT Model check if insert operation is executable
statusReason: Unknow operation

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:153:7
     return contains(char.id, sequence);
   } else if (operation === Operation.Insert) {
     return (
-      contains(char.nextId, sequence) &&
-      contains(char.prevId, sequence) &&
-      !contains(char.id, sequence)
+      true
     );
   } else {
killedBy: CRDT WOOT Model check if insert operation is executable
statusReason: expected true to deeply equal false

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:153:7
     return contains(char.id, sequence);
   } else if (operation === Operation.Insert) {
     return (
-      contains(char.nextId, sequence) &&
-      contains(char.prevId, sequence) &&
+      true &&
       !contains(char.id, sequence)
     );
killedBy: CRDT WOOT Model check if insert operation is executable
statusReason: expected true to deeply equal false

[Killed] BooleanLiteral
js/crdt-woot/src/model.ts:155:7
     return (
       contains(char.nextId, sequence) &&
       contains(char.prevId, sequence) &&
-      !contains(char.id, sequence)
+      contains(char.id, sequence)
     );
   } else {
killedBy: CRDT WOOT Model check if insert operation is executable
statusReason: expected false to deeply equal true

[NoCoverage] BlockStatement
js/crdt-woot/src/model.ts:157:10
       contains(char.prevId, sequence) &&
       !contains(char.id, sequence)
     );
-  } else {
-    throw Error('Unknow operation');
-  }
+  } else {}
 }
 

[NoCoverage] StringLiteral
js/crdt-woot/src/model.ts:158:17
       !contains(char.id, sequence)
     );
   } else {
-    throw Error('Unknow operation');
+    throw Error("");
   }
 }

[Killed] BlockStatement
js/crdt-woot/src/model.ts:162:44
   }
 }
 
-export function getState(sequence: Char[]) {
-  let text = '';
-  let i = 0;
-  const len = Object.keys(sequence).length - 1;
-  while (i < len) {
-    const char = sequence[i];
-    if (!char.value && char.visible) {
-      throw Error('Cant find char value: ');
-    }
-    if (char.value && char.visible) {
-      text += char.value;
-    }
-    i++;
-  }
-  return text;
-}
+export function getState(sequence: Char[]) {}
 
killedBy: CRDT WOOT Model get the whole state of the sequence
statusReason: expected undefined to deeply equal 'abc'

[Killed] ArithmeticOperator
js/crdt-woot/src/model.ts:165:15
 export function getState(sequence: Char[]) {
   let text = '';
   let i = 0;
-  const len = Object.keys(sequence).length - 1;
+  const len = Object.keys(sequence).length + 1;
   while (i < len) {
     const char = sequence[i];
killedBy: CRDT WOOT Model get the whole state of the sequence
statusReason: Cannot read property 'value' of undefined

[Killed] EqualityOperator
js/crdt-woot/src/model.ts:166:10
   let text = '';
   let i = 0;
   const len = Object.keys(sequence).length - 1;
-  while (i < len) {
+  while (i >= len) {
     const char = sequence[i];
     if (!char.value && char.visible) {
killedBy: CRDT WOOT Model get the whole state of the sequence
statusReason: expected '' to deeply equal 'abc'

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:166:10
   let text = '';
   let i = 0;
   const len = Object.keys(sequence).length - 1;
-  while (i < len) {
+  while (false) {
     const char = sequence[i];
     if (!char.value && char.visible) {
killedBy: CRDT WOOT Model get the whole state of the sequence
statusReason: expected '' to deeply equal 'abc'

[Killed] LogicalOperator
js/crdt-woot/src/model.ts:168:9
   const len = Object.keys(sequence).length - 1;
   while (i < len) {
     const char = sequence[i];
-    if (!char.value && char.visible) {
+    if (!char.value || char.visible) {
       throw Error('Cant find char value: ');
     }
killedBy: CRDT WOOT Model get the whole state of the sequence
statusReason: Cant find char value:

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:168:9
   const len = Object.keys(sequence).length - 1;
   while (i < len) {
     const char = sequence[i];
-    if (!char.value && char.visible) {
+    if (true) {
       throw Error('Cant find char value: ');
     }
killedBy: CRDT WOOT Model get the whole state of the sequence
statusReason: Cant find char value:

[Killed] ConditionalExpression
js/crdt-woot/src/model.ts:171:9
     if (!char.value && char.visible) {
       throw Error('Cant find char value: ');
     }
-    if (char.value && char.visible) {
+    if (false) {
       text += char.value;
     }
killedBy: CRDT WOOT Model get the whole state of the sequence
statusReason: expected '' to deeply equal 'abc'

[Killed] BlockStatement
js/crdt-woot/src/model.ts:171:37
     if (!char.value && char.visible) {
       throw Error('Cant find char value: ');
     }
-    if (char.value && char.visible) {
-      text += char.value;
-    }
+    if (char.value && char.visible) {}
     i++;
   }
killedBy: CRDT WOOT Model get the whole state of the sequence
statusReason: expected '' to deeply equal 'abc'

[Killed] AssignmentOperator
js/crdt-woot/src/model.ts:172:7
       throw Error('Cant find char value: ');
     }
     if (char.value && char.visible) {
-      text += char.value;
+      text -= char.value;
     }
     i++;
killedBy: CRDT WOOT Model get the whole state of the sequence
statusReason: expected NaN to deeply equal 'abc'
