[Survived] StringLiteral
js/crdt-woot/src/utils.ts:5:47
 import { v4 as uuidv4 } from 'uuid';
 import { shuffle } from 'lodash';
 
-export const generateSite = (siteId: string = '1') => {
+export const generateSite = (siteId: string = "") => {
   const startId = uuidv4();
   const endId = uuidv4();

[Survived] ObjectLiteral
js/crdt-woot/src/utils.ts:10:13
   const endId = uuidv4();
   const start: Char = {
     id: startId,
-    charId: {
-      siteId,
-      clock: 0,
-    },
+    charId: {},
     value: '',
     visible: false,

[Survived] StringLiteral
js/crdt-woot/src/utils.ts:14:12
       siteId,
       clock: 0,
     },
-    value: '',
+    value: "Stryker was here!",
     visible: false,
     prevId: null,

[Killed] BooleanLiteral
js/crdt-woot/src/utils.ts:15:14
       clock: 0,
     },
     value: '',
-    visible: false,
+    visible: true,
     prevId: null,
     nextId: endId,
killedBy: CRDT WOOT Model get the whole state of the sequence
statusReason: Cant find char value:

[Killed] ArrowFunction
js/crdt-woot/src/utils.ts:33:29
   return { start, end, siteId };
 };
 
-export const generateChar = (
-  siteId: string,
-  clock: number,
-  alpha: string,
-  prevId: string,
-  nextId: string
-): Char => ({
-  id: uuidv4(),
-  charId: {
-    siteId,
-    clock,
-  },
-  value: alpha,
-  visible: true,
-  prevId,
-  nextId,
-});
+export const generateChar = () => undefined;
 
killedBy: CRDT WOOT Model determine precedence between two characters from different sites
statusReason: Cannot read property 'charId' of undefined
